app/services/application_service.rb

  def jwt_encoder(user)
    error_validate_failed!("ไม่มี params user") if user.nil?
    error_validate_failed!("ไม่มี user id: #{user.id} นี้อยู่ในระบบ") if User.find_by(id: user.id).nil?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def jwt_decoder(token)
    error_validate_failed!("ไม่มี params token") if token.nil?

    decoded_token = JWT.decode(token, Settings.jwt.secret, true)
    user_id       = decoded_token[0]['data']['user_id']
    user          = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]