app/services/auth/base.rb

  def get_user(account_id, token, token_type)
    Auth::GuardValidation.new.validate_get_user(account_id, token, token_type)

    user = User.find_or_initialize_by(account_id: account_id, token: token, token_type: token_type)
---
SELECT "users".* FROM "users" WHERE "users"."account_id" = $1 AND "users"."token" = $2 AND "users"."token_type" = $3 LIMIT $4