app/services/user/get_info.rb

  def call(user_id)
    # Guard
    User::GuardValidation.new.validate_get_info(user_id)

    # perform
    User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]