app/services/user/guard_validation.rb

  def validate_get_info(user_id)
    error_validate_failed!("ไม่มี params user_id") if user_id.nil?
    error_validate_failed!("ไม่มี User นี้จาก user_id: #{user_id}") if User.find_by(id: user_id).nil?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]